---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInViewError
source: html/01d600ff-427e-76a4-81b2-4b708acd40ff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInViewError Property

Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteInViewError { get; }
```